# ImageExportOptions Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ImageExportOptions Constructor
ImageExportOptions Class See Also
---
Constructs a new instance of the options class used to produce images.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public ImageExportOptions()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
ImageExportOptions()
```

# See Also
ImageExportOptions Class
Autodesk.Revit.DB Namespace